/***
	************************************************************************************************
	*	@version V1.0
	*  @date    2023-3-21
	*	@author  反客科技
	*	@brief   按键接口相关函数
   ************************************************************************************************
   *  @description
	*
	*	实验平台：反客 SWM34SVET6 核心板 （型号：FK-SWM34SVE-M1）
	*	淘宝地址：https://shop212360197.taobao.com
	*	QQ交流群：536665479
	*
>>>>> 文件说明：
	*
	*  初始化按键引脚，配置为上拉输入
	*
	************************************************************************************************
***/

#include "uart.h" 


/*************************************************************************************************
*	函 数 名:	KEY_Init
*	入口参数:	无
*	返 回 值:无
*	函数功能:	初始化按键引脚
*	说    明:配置为上拉输入			
*************************************************************************************************/

void KEY_Init(void)
{

	GPIO_Init(KEY_PORT, KEY_PIN, 0, 1, 0, 0);			// 输入模式、上拉使能、禁止下拉、推挽
}

/*************************************************************************************************
*	函 数 名:	KEY_Scan
*	入口参数:	无
*	返 回 值:KEY_ON - 按键按下，KEY_OFF - 按键放开 
*	函数功能:	按键扫描
*	说    明:周期性调用该函数，根据返回值判断状态			
*************************************************************************************************/
	
uint8_t	KEY_Scan(void)
{
	if( GPIO_GetBit ( KEY_PORT,KEY_PIN) == 0 )	//检测按键是否被按下
	{	
		osDelay(10);	//延时消抖
		if( GPIO_GetBit ( KEY_PORT,KEY_PIN) == 0)	//再次检测是否为低电平
		{
			while(  GPIO_GetBit ( KEY_PORT,KEY_PIN) == 0);	//等待按键放开
			return KEY_ON;	//返回按键按下标志
		}
	}
	return KEY_OFF;	
}









