/***
	*************************************************************************************************
	*	@version V1.0
	*  @date    2023-3-20
	*	@author  反客科技	
	*	@brief   LED相关
   *************************************************************************************************
   *  @description
	*
	*	实验平台：反客 SWM34SVET6 核心板 （型号：FK-SWM34SVE-M1）
	*	淘宝地址：https://shop212360197.taobao.com
	*	QQ交流群：536665479
	*
>>>>> 文件说明：
	*
	*	初始化LED的IO口，配置为推挽输出
	*
	************************************************************************************************
***/

#include "led.h"  

//	LED引脚初始化
// 
void LED_Init(void)
{
	GPIO_Init(LED1_PORT, LED1_PIN, 1, 0, 0, 0);		// 输出模式、禁止上拉、禁止下拉、推挽
}

